alert(
  "У королівстві, де легенди оживають, молодий оруженосець Люк мріє стати рицарем. Він служить Сір Роберту, рицарю, який вважає, що честь — це найвища добродійність."
);
let firstChoose;
let first = prompt(
  "Сір Роберт ставить перед Люком випробування, що визначить його долю.\nОберіть варіант\n1. Вирушити в ліс\n2. Піти через село\n3. Відправитися до замку дракона\n"
);
if (first == 1) {
  let first = prompt(
    "Люк зустрічає чарівницю, що пропонує зілля сили в обмін на обіцянку.\nОберіть варіант:\n1. Прийняти зілля\n2. Відмовитися"
  );
  if (first == 1) {
    alert(
      "Люк отримує надприродну силу, але залишається в боргу перед чарівницею"
    );
    firstChoose = 4;
  } else if (first == 2) {
    alert("Люк вибирає чесний шлях, відмовляючись від легкого успіху");
    firstChoose = 5;
  } else firstChoose = 99;
} else if (first == 2) {
  let first = prompt(
    "Люк допомагає селянам, які потерпають від голови розбійників\nОберіть варіант:\n1. Допомогти силою\n2. Знайти мирне рішення"
  );
  if (first == 1) {
    alert("Люк використовує силу для захисту селян, але отримує поранення");
    firstChoose = 6;
  } else if (first == 2) {
    alert("Люк вирішує конфлікти миром, заробляючи повагу як лідера");
    firstChoose = 7;
  } else {
    firstChoose = 99;
  }
} else if (first == 3) {
  let first = prompt(
    "Люк вирішує випробувати себе, викликаючи дракона на бій\nОберіть варіант:\n1. Бій з драконом\n2. Спроба перемовин"
  );
  if (first == 1) {
    confirm(
      "Люк гине, але його вчинок вважається героїчним\nПочати заново?\n(сторінка не перезавантажиться без продовження)"
    );
    firstChoose = "101";
    location.reload(); // Сторінка не перезавантажується без продовження всіх повідомлень.
  } else if (first == 2) {
    alert("Люк дізнається, що дракон не хоче воювати, і вони досягають миру");
    firstChoose = 9;
  }
} else {
  firstChoose = 99;
}

let second = prompt(
  "Після повернення з подорожей Люка викликають на турнір\nОберіть варіант:\n1. Боротьба за честь\n2. Допомога іншому учаснику\n3. Відмова від бою"
);
if (second == 1) {
  alert("Люк демонструє свої навички, здобуваючи повагу");
} else if (second == 2) {
  alert("Люк допомагає пораненому рицарю, показуючи своє серце");
} else if (second == 3) {
  alert(
    "Люк відмовляється боротися, стверджуючи, що справжній рицар знає, коли не варто воювати"
  );
} else {
  second = 99;
}

let third = prompt(
  "Король, вражений діями Люка, пропонує йому останнє завдання.\nОберіть варіант:\n1. Захистити королівство\n2. Пошук зниклої реліквії"
);
if (third == 1) {
  alert("Люк веде війська проти ворога, демонструючи свою відвагу");
  third = 1;
} else if (third == 2) {
  alert("Люк вирушає за древньою реліквією, що може врятувати королівство");
  third = 2;
} else {
  third = 99;
}

first = firstChoose;

if (first == 99 || second == 99 || third == 99) {
  alert("Люк помер спідкнувшись, бо щось не те натиснув");
} else if (first == 5 && second == 1) {
  alert(
    "Фінал:\n" +
      "Люк стає рицарем, відомим своєю чесністю та мужністю, обираючи шлях служіння королівству"
  );
} else if (first == 7 && second == 3) {
  alert(
    "Фінал:\n" +
      "Люк залишає турнір, стаючи захисником селян і прикладом для інших, що справжня сила криється в мудрості та співчутті"
  );
} else if (first == 9 && third == 2) {
  alert(
    "Фінал:\n" +
      "Люк доводить, що можна знайти мир навіть із драконами, і врятувати королівство без насильства, стаючи легендою."
  );
} else if (first == 101) {
  alert(
    "Фінал:\n" +
      "Люк гине, але його ім'я вічно живе в легендах як символ непереможної сміливості та жертовності"
  );
} else {
  alert("Фінал:\n" + "'Інша надумана історія'");
}
alert("Гарного дня!");
